app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `data_operator`
WHERE `posisi` = 'Operator Sewing'
SELECT COUNT(*) AS `numrows`
FROM `data_operator`
WHERE `posisi` = 'Operator Cutting'
SELECT COUNT(*) AS `numrows`
FROM `data_operator`
WHERE `posisi` = 'Operator Assembling'
---
    public function index(){
        $staffJobs = new StaffModel();
        $operatorJobs = new OperatorModel();
        $employe_operator = new Data_OperatorModel();

        $staff = $staffJobs->findAll();
        $operator= $operatorJobs -> findAll();
        $employe_1=$employe_operator -> findAll();
        $pelamar_sewing = $employe_operator->where('posisi','Operator Sewing')->countAllResults();
        $pelamar_cutting = $employe_operator->where('posisi', 'Operator Cutting')->countAllResults();
        $pelamar_assembling = $employe_operator->where('posisi', 'Operator Assembling')->countAllResults();