app/Controllers/Staff.php

public function detail($id){
        $dataOperatorModel = new Data_OperatorModel();
        $dataOp = $dataOperatorModel->where(['id' => $id])->first();
---
SELECT *
FROM `data_operator`
WHERE `id` = '2'
 LIMIT 1